---
type: FieldDomainPointsByXYZ
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 1
tags: [revit-api, class]
---

# FieldDomainPointsByXYZ

`Autodesk.Revit.DB.Analysis.FieldDomainPointsByXYZ` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FieldDomainPointsByXYZ | 2011 | `public FieldDomainPointsByXYZ ( IList < XYZ > points )` |